In [1]:
#package 
import pandas as pd
import numpy as np

In [3]:
# inbult methods to read files: 
- csv, excel,

NameError: name 'csv' is not defined

In [10]:
# dir(pd)
df=pd.read_csv("text.txt")
df.head()

                             Thie is the first line.
0                           This is the second line.
1                                This is third line.
2                            Thie is the forth line.
3                            This is the fifth line.
4  This is sixth line.Thie is the seventh line. T...

In [11]:
### nested list - dictionary
df = pd.DataFrame(data = ([1,2,'3',4],[4,5],[2,4,5],[5,6,7,8]), 
                            columns=['c1','c2','c3','c4'])
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [10]:
df['c2'] # accessing series type

0    2
1    5
2    4
3    6
Name: c2, dtype: int64

In [11]:
df[['c2']] # accessign DataFrame type

   c2
0   2
1   5
2   4
3   6

In [16]:
# df[['c2'],['c3'],['c5']]
# df[['c2','c3','c5']]

In [17]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [18]:
# accessign by index (.iloc)
df.iloc[:3,:3] # accessign by index

   c1  c2    c3
0   1   2     3
1   4   5  None
2   2   4     5

In [19]:
df.iloc[:3,:]

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN

In [20]:
df.iloc[:,1:3]

   c2    c3
0   2     3
1   5  None
2   4     5
3   6     7

In [21]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [26]:
# accessign by label (.loc)
df.loc[2:4,['c2','c3']]

   c2 c3
2   4  5
3   6  7

In [27]:
## filter on DataFrame

In [28]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [35]:
# Select records from DataFrame df where col2 having  > 2
condition = df['c2']>2
condition
# df.where(df['c2'] >2)

0    False
1     True
2     True
3     True
Name: c2, dtype: bool

In [36]:
df[condition] # square brackets

   c1  c2    c3   c4
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [12]:
df.where(df['c2'] >2)

    c1   c2    c3   c4
0  NaN  NaN   NaN  NaN
1  4.0  5.0  None  NaN
2  2.0  4.0     5  NaN
3  5.0  6.0     7  8.0

In [40]:
condition = (df['c2']>2) & (df['c1']>2)
condition

0    False
1     True
2    False
3     True
dtype: bool

In [42]:
df[condition]

   c1  c2    c3   c4
1   4   5  None  NaN
3   5   6     7  8.0

In [43]:
df[(df['c2']>2) & (df['c1']>2)]

   c1  c2    c3   c4
1   4   5  None  NaN
3   5   6     7  8.0

In [44]:
df.where((df['c2']>2) & (df['c1']>2))

    c1   c2    c3   c4
0  NaN  NaN   NaN  NaN
1  4.0  5.0  None  NaN
2  NaN  NaN   NaN  NaN
3  5.0  6.0     7  8.0

In [47]:
df[(df['c2']>2) & (df['c1']>2)][['c3']]

     c3
1  None
3     7

In [46]:
## 
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [53]:
df.head(n=3)

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN

In [54]:
df.tail(2)

   c1  c2 c3   c4
2   2   4  5  NaN
3   5   6  7  8.0

In [56]:
## returns list of column
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [58]:
df.shape #(rowsa nd columns)

(4, 4)

In [61]:
df.values

array([[1, 2, '3', 4.0],
       [4, 5, None, nan],
       [2, 4, 5, nan],
       [5, 6, 7, 8.0]], dtype=object)

In [62]:
df['c1'].values

array([1, 4, 2, 5], dtype=int64)

In [ ]:
# saving object
df.to_

In [63]:
# sort
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [71]:
# sort df as per c2
df.sort_values(by = ['c2'], ascending=True)

   c1  c2    c3   c4
0   1   2     3  4.0
2   2   4     5  NaN
1   4   5  None  NaN
3   5   6     7  8.0

In [74]:
df.sort_values(by = ['c4'], ascending=[False])

   c1  c2    c3   c4
3   5   6     7  8.0
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN

In [75]:
## Addting new columns
df['c5'] = 3
df

   c1  c2    c3   c4  c5
0   1   2     3  4.0   3
1   4   5  None  NaN   3
2   2   4     5  NaN   3
3   5   6     7  8.0   3

In [81]:
df['c6'] = np.linspace(10,14,4)
df

   c1  c2    c3   c4  c5         c6
0   1   2     3  4.0   3  10.000000
1   4   5  None  NaN   3  11.333333
2   2   4     5  NaN   3  12.666667
3   5   6     7  8.0   3  14.000000

In [86]:
# delete column
df.drop(['c3'], axis=1)

   c1  c2   c4  c5         c6
0   1   2  4.0   3  10.000000
1   4   5  NaN   3  11.333333
2   2   4  NaN   3  12.666667
3   5   6  8.0   3  14.000000

In [87]:
df

   c1  c2    c3   c4  c5         c6
0   1   2     3  4.0   3  10.000000
1   4   5  None  NaN   3  11.333333
2   2   4     5  NaN   3  12.666667
3   5   6     7  8.0   3  14.000000

In [89]:
df.drop(['c3'], axis=1, inplace=True)  # inspace will save the changes in the origional df

In [90]:
df

   c1  c2   c4  c5         c6
0   1   2  4.0   3  10.000000
1   4   5  NaN   3  11.333333
2   2   4  NaN   3  12.666667
3   5   6  8.0   3  14.000000

In [93]:
##
df.describe()

             c1        c2        c4   c5         c6
count  4.000000  4.000000  2.000000  4.0   4.000000
mean   3.000000  4.250000  6.000000  3.0  12.000000
std    1.825742  1.707825  2.828427  0.0   1.721326
min    1.000000  2.000000  4.000000  3.0  10.000000
25%    1.750000  3.500000  5.000000  3.0  11.000000
50%    3.000000  4.500000  6.000000  3.0  12.000000
75%    4.250000  5.250000  7.000000  3.0  13.000000
max    5.000000  6.000000  8.000000  3.0  14.000000

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
c1    4 non-null int64
c2    4 non-null int64
c4    2 non-null float64
c5    4 non-null int64
c6    4 non-null float64
dtypes: float64(2), int64(3)
memory usage: 288.0 bytes

In [95]:
# How to apply user-defined function on given DataFrame
## .apply(), applymap()

In [97]:
df

   c1  c2   c4  c5         c6
0   1   2  4.0   3  10.000000
1   4   5  NaN   3  11.333333
2   2   4  NaN   3  12.666667
3   5   6  8.0   3  14.000000

In [98]:
df.apply('mean', axis=0) # column wise

c1     3.00
c2     4.25
c4     6.00
c5     3.00
c6    12.00
dtype: float64

In [99]:
df.apply('mean', axis=1) # row wise

0    4.000000
1    5.833333
2    5.416667
3    7.200000
dtype: float64

In [102]:
#
df.applymap(lambda x:x*2)

   c1  c2    c4  c5         c6
0   2   4   8.0   6  20.000000
1   8  10   NaN   6  22.666667
2   4   8   NaN   6  25.333333
3  10  12  16.0   6  28.000000

In [103]:
## looping through DataFrame

for each in df.items():
    print(each)

('c1', 0    1
1    4
2    2
3    5
Name: c1, dtype: int64)
('c2', 0    2
1    5
2    4
3    6
Name: c2, dtype: int64)
('c4', 0    4.0
1    NaN
2    NaN
3    8.0
Name: c4, dtype: float64)
('c5', 0    3
1    3
2    3
3    3
Name: c5, dtype: int64)
('c6', 0    10.000000
1    11.333333
2    12.666667
3    14.000000
Name: c6, dtype: float64)

In [104]:
for each in df.iteritems():
    print(each)

('c1', 0    1
1    4
2    2
3    5
Name: c1, dtype: int64)
('c2', 0    2
1    5
2    4
3    6
Name: c2, dtype: int64)
('c4', 0    4.0
1    NaN
2    NaN
3    8.0
Name: c4, dtype: float64)
('c5', 0    3
1    3
2    3
3    3
Name: c5, dtype: int64)
('c6', 0    10.000000
1    11.333333
2    12.666667
3    14.000000
Name: c6, dtype: float64)

In [109]:
for each in df.iterrows():
    print(each)

(0, c1     1.0
c2     2.0
c4     4.0
c5     3.0
c6    10.0
Name: 0, dtype: float64)
(1, c1     4.000000
c2     5.000000
c4          NaN
c5     3.000000
c6    11.333333
Name: 1, dtype: float64)
(2, c1     2.000000
c2     4.000000
c4          NaN
c5     3.000000
c6    12.666667
Name: 2, dtype: float64)
(3, c1     5.0
c2     6.0
c4     8.0
c5     3.0
c6    14.0
Name: 3, dtype: float64)

In [110]:
for each in df.iterrows():
    print(each[1])

c1     1.0
c2     2.0
c4     4.0
c5     3.0
c6    10.0
Name: 0, dtype: float64
c1     4.000000
c2     5.000000
c4          NaN
c5     3.000000
c6    11.333333
Name: 1, dtype: float64
c1     2.000000
c2     4.000000
c4          NaN
c5     3.000000
c6    12.666667
Name: 2, dtype: float64
c1     5.0
c2     6.0
c4     8.0
c5     3.0
c6    14.0
Name: 3, dtype: float64

In [106]:
for each in df.itertuples():
    print(each)

Pandas(Index=0, c1=1, c2=2, c4=4.0, c5=3, c6=10.0)
Pandas(Index=1, c1=4, c2=5, c4=nan, c5=3, c6=11.333333333333334)
Pandas(Index=2, c1=2, c2=4, c4=nan, c5=3, c6=12.666666666666666)
Pandas(Index=3, c1=5, c2=6, c4=8.0, c5=3, c6=14.0)

In [111]:
df['c4'] = ['a','b','c','d']

In [112]:
df

   c1  c2 c4  c5         c6
0   1   2  a   3  10.000000
1   4   5  b   3  11.333333
2   2   4  c   3  12.666667
3   5   6  d   3  14.000000

In [116]:
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     5  NaN
3   5   6     7  8.0

In [117]:
# Saving df file
df.to_csv('df_save')

### group by on DataFrame
- Aggregation
- Transformation
- Filteration

In [16]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 
                     'Kings', 'Kings', 'Kings', 'Kings', 'Riders',
                     'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,
                     2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,
                      788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df.shape)
df.head()

(12, 4)

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [17]:
# df.groupby(’Kings’)  # splits data into Kings unique group
# df.groupby([‘Kings’,’Year’]) # splits data by kings followed by Year; group by multiple columns
# df.groupby(‘Kings’).groups # returns groups details on consol

In [18]:
## find avg of the points in each team
df.groupby(['Team']).groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 5, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [19]:
df[df.Team == 'Devils']['Points'].mean()

768.0

In [20]:
df.groupby(['Team'])['Points'].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [21]:
# max
df.groupby(['Team'])['Points'].max()

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

In [22]:
df.groupby(['Team'])(['Points'].mean() & ['Rank'].max())

AttributeError: 'list' object has no attribute 'mean'

In [23]:
df.groupby('Team')['Points','Rank'].agg({'Points':'mean',
                                           'Rank':max})

        Points  Rank
Team
Devils  768.00     3
Kings   774.25     4
Riders  762.25     2
Royals  752.50     4

In [24]:
df.groupby('Team')['Points','Rank','Year'].agg({'Points':'mean',
                                           'Rank':min,
                                               'Year':max})

        Points  Rank  Year
Team
Devils  768.00     2  2015
Kings   774.25     1  2017
Riders  762.25     1  2017
Royals  752.50     1  2015

### Groupby - Transformation

In [159]:
##
# from each point subtract average of the points: 
# avg should calculated on data belonging to the same team

In [156]:
    df['diff_point'] = df.groupby('Team')['Points'].transform(lambda x:x- np.mean(x))
    df.head()

     Team  Rank  Year  Points  diff_point
0  Riders     1  2014     876      113.75
1  Riders     2  2015     789       26.75
2  Devils     2  2014     863       95.00
3  Devils     3  2015     673      -95.00
4   Kings     3  2014     741      -33.25

### groupby - filter

In [161]:
df.groupby('Team').filter(lambda x: len(x)>2)

      Team  Rank  Year  Points  diff_point
0   Riders     1  2014     876      113.75
1   Riders     2  2015     789       26.75
4    Kings     3  2014     741      -33.25
5    Kings     4  2015     812       37.75
6    Kings     1  2016     756      -18.25
7    Kings     1  2017     788       13.75
8   Riders     2  2016     694      -68.25
11  Riders     2  2017     690      -72.25

### DataFrame Merge

In [1]:
import pandas as pd
import numpy as np

### briefing on kion types: 2 types: inner join, outer join(left, right, full)

T1 T2
            - inner joinL all the common recors are fetched/selected

            - left outer join: common + remeining element from left table( left table is reference table)
            - right outer join: common + remeining element from right table( left table is reference table)  
            - full outer join: common + remeining element from left & right table

In [2]:
pd.merge()

<function pandas.core.reshape.merge.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)>

In [4]:
# •Print left and right
# •Merge on id
# •Merge on id & subject_id
# •Perform left join on key = id
# •Perform right join on key = id
# •Perform outer join on key = id
# •Perform left join on keys = (id, subject_id)
# •Perform right join on keys = (id, subject_id)
# •Perform outer join on keys = (id, subject_id)

left = pd.DataFrame({ 'id':[1,2,3,4,5],
                     'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
                     'subject_id':['sub1','sub2','sub4','sub6','sub5']}) 
right = pd.DataFrame( {'id':[1,2,3,4,5],
                       'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
                        'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [17]:
# Print left and right
print(left)
print('\n',right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

    id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [12]:
# Perform inner join on key = id
pd.merge(left = left, right = right, how='inner', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [13]:
# Perform left join on key = id and subject id
pd.merge(left = left, right = right, how='inner', on = ['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [14]:
#Perform left join on key = id
pd.merge(left = left, right = right, how='left', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [15]:
# Perform right join on key = id
pd.merge(left = left, right = right, how='right', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [18]:
# Perform outer join on key = id
pd.merge(left = left, right = right, how='outer', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [19]:
# Perform left join on keys = (id, subject_id)
pd.merge(left = left, right = right, how='left', on = ['id', 'subject_id'])

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [21]:
# Perform Right join on keys = (id, subject_id)
pd.merge(left = left, right = right, how='right', on = ['id', 'subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty
2   1     NaN       sub2  Billy
3   2     NaN       sub4  Brian
4   3     NaN       sub3   Bran

In [22]:
# Perform outer join on keys = (id, subject_id)
pd.merge(left = left, right = right, how='outer', on = ['id', 'subject_id'])

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty
5   1     NaN       sub2  Billy
6   2     NaN       sub4  Brian
7   3     NaN       sub3   Bran